int x = 3;
int y = -8;

if(x > 0 && y > 0) {
	Console.WriteLine($"Точка с координатами x = {x} и y = {y} пренадлежит I четверти");
}

if(x < 0 && y > 0) {
	Console.WriteLine($"Точка с координатами x = {x} и y = {y} пренадлежит II четверти");
}

if(x < 0 && y < 0) {
	Console.WriteLine($"Точка с координатами x = {x} и y = {y} пренадлежит III четверти");
}

if(x > 0 && y < 0) {
	Console.WriteLine($"Точка с координатами x = {x} и y = {y} пренадлежит IV четверти");
}

if(x == 0 && y == 0) {
	Console.WriteLine($"Точка с координатами x = {x} и y = {y} находится в начале координат");
}